Repository: mehmetaliyazar/RSAKeyManager
Catalog: RSAKeyManager/RSAKeyManager/Languages/language_*.resx
Languages: tr

source: Decrypted Text
tr: Şifresi Çözülmüş Metin

source: Encrypted Text
tr: Şifrelenmiş Metin

source: Error
tr: Hata

source: Export
tr: Dışa Aktar

source: Export Key
tr: Anahtarı Dışa Aktar

# formMain
source: RSA Key Manager
tr: RSA Anahtar Yöneticisi

# formSelectKeySize
source: Select Key Size
tr: Anahtar Boyutu Seçin

# formSelectKeyType
source: Select a key type to export
tr: Dışa aktarmak için anahtar türü seçin

source: Generate
tr: Oluştur

source: Generate Key
tr: Anahtar Oluştur

source: Import Key
tr: Anahtarı İçe Aktar

source: Information
tr: Bilgi

source: Key
tr: Anahtar

source: Key Information
tr: Anahtar Bilgisi

source: Key Size
tr: Anahtar Boyutu

# msgDecryptCryptographicError
source: Public keys could not use for decryption! Please use private key.
tr: Açık anahtarlar şifre çözemez! Lütfen özel anahtar kullanın.

# msgDecryptError
source: Decryption failed! Please be sure you are entering an encrypted text.
tr: Şifre çözme başarısız! Lütfen şifrelenmiş metin girdiğinizden emin olun.

# msgDecryptError2
source: Error during decryption.
tr: Şifre çözülürken bir hata oluştu!

# msgEncryptError
source: An error occurred trying to encrypt
tr: Şifreleme sırasında bir hata oluştu.

# msgGenerated
source: Key Generated Successfully!
tr: Anahtar Başarıyla Oluşturuldu!

# msgGenerateFailed
source: Generation failed!
tr: Oluşturma başarısız!

# msgPrivateKeyExported
source: Private Key Exported Successfully!
tr: Özel anahtar başarıyla dışa aktarıldı!

# msgPublicKeyExported
source: Public Key Exported Successfully!
tr: Açık anahtar başarıyla dışa aktarıldı!

# msgSelectKeySize
source: Please select a key size.
tr: Lütfen anahtar boyutu seçin.

# msgSelectType
source: Please select a key to export.
tr: Lütfen anahtar türü seçin.

# NoKey
source: THERE IS NO KEY
tr: ANAHTAR YOK

source: Private
tr: Özel

source: Private Key
tr: Özel Anahtar

source: Public
tr: Açık

source: Public Key
tr: Açık Anahtar

source: Recommended
tr: Önerilen

source: Text To Decrypt
tr: Çözülecek Metin

source: Text To Encrypt
tr: Şifrelenecek Metin

source: Warning
tr: Uyarı
